# -*- coding: utf-8 -*-
"""Number_Guessing_Game.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1WI3QJB992Z2fP21UivqDS-tD5RXs0GBZ (открытый доступ)

# Угадай число
Нужно написать программу, которая угадывает число за минимальное число попыток.

## Условия соревнования
- Компьютер загадывает целое число от 1 до 100, и нам его нужно угадать. Под «угадать», подразумевается «написать программу, которая угадывает число».    
- Алгоритм учитывает информацию о том, больше ли случайное число или меньше нужного нам.
- Необходимо добиться того, чтобы программа угадывала число меньше, чем за 20 попыток.

# **Первый вариант**
"""

import random

def guess_number():
    min_number = 1
    max_number = 100
    target_number = random.randint(min_number, max_number)
    attempts = 0

    while True:
        guess = (min_number + max_number) // 2  # Угадываем середину диапазона
        attempts += 1

        if guess == target_number:
            print(f"Поздравляем! Вы угадали число {target_number} за {attempts} попыток.")
            break
        elif guess < target_number:
            print(f"Попытка {attempts}: Мое число больше {guess}.")
            min_number = guess + 1
        else:
            print(f"Попытка {attempts}: Мое число меньше {guess}.")
            max_number = guess - 1

guess_number()

"""# **Второй вариант**"""

import numpy as np

def binary_search_predict(number: int) -> int:

    count = 0
    min_range = 1
    max_range = 100

    while True:
        count += 1
        predict = (min_range + max_range) // 2

        if predict == number:
            break
        elif predict < number:
            min_range = predict + 1
        else:
            max_range = predict - 1

    return count

def score_game(predict_func) -> int:

    count_attempts = []
    np.random.seed(1)
    random_numbers = np.random.randint(1, 101, size=(1000))

    for number in random_numbers:
        count_attempts.append(predict_func(number))

    average_score = int(np.mean(count_attempts))
    print(f"Алгоритм угадывает число в среднем за {average_score} попыток")
    return average_score

if __name__ == "__main__":
    score_game(binary_search_predict)